app/controllers/comments_controller.rb

  def create
    @recipe = Recipe.find(params[:recipe_id])
    @comment = @recipe.comments.create(comment_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "keith"], ["body", "comment away!"], ["recipe_id", 1], ["created_at", "2015-06-01 23:14:29.422375"], ["updated_at", "2015-06-01 23:14:29.422375"]]

  def destroy
    @recipe = Recipe.find(params[:recipe_id])
    @comment = @recipe.comments.find(params[:id])
    @comment.destroy
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["recipe_id", 4], ["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]