app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes" WHERE (dish LIKE '%lasagna%')  ORDER BY created_at DESC

  def search
    @recipes = if params[:search].present?
      Recipe.search(params[:search]).order("created_at DESC")
---
SELECT "recipes".* FROM "recipes" WHERE (dish LIKE '%%')  ORDER BY created_at DESC

  def create
  @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("dish", "cuisine", "ingredients", "directions", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["dish", "lasagna"], ["cuisine", "italian"], ["ingredients", "pasta"], ["directions", "cook at 425"], ["created_at", "2015-06-02 15:43:13.013987"], ["updated_at", "2015-06-02 15:43:13.013987"]]

  def update
    @recipe = Recipe.find(params[:id])

    if @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "recipes" SET "body" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["body", "edited!"], ["updated_at", "2015-06-01 22:42:13.007062"], ["id", 4]]